# Series

In [2]:
import pandas as pd
import numpy as np

using list

In [31]:
data = [10,20,30,40,50,60,70,80,90]
df = pd.Series(data,index=range(1,10))
print(df)

1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [32]:
data = ['Shreeram','Shree','Ram','Riya','Sushma','John']
df = pd.Series(data,index=range(1,7),dtype=object)
print(df)

1    Shreeram
2       Shree
3         Ram
4        Riya
5      Sushma
6        John
dtype: object

using dictionary

In [76]:
data = {'name':'shreeram','age':27,'gender':'male','salary':10000}
df = pd.Series(data,dtype=object)
print(df)

name      shreeram
age             27
gender        male
salary       10000
dtype: object

using numpy arrays

In [94]:
arr = np.array([10,20,30,40,50,60,70,80,90])
s = pd.Series(arr,index=['a','b','c','d','e','f','g','h','i'])
print(s['a'])

10

# DataFrame

In [108]:
data = [10,20,30,40,50]
df = pd.DataFrame(data,columns=['number'])
print(df)

   number
0      10
1      20
2      30
3      40
4      50

In [38]:
data = [{'name': 'Shreeram', 'age': 27, 'gender': 'Male', 'salary': 10000},
        {'name': 'Shree', 'age': 28, 'gender': 'Female', 'salary': 12000},
        {'name': 'Ram', 'age': 29, 'gender': 'Male', 'salary': 12000},
        {'name': 'Riya', 'age': 45, 'gender': 'Male', 'salary': 13000},
        {'name': 'Sushma', 'age': 15, 'gender': 'Female', 'salary': 11000},
        {'name': 'John', 'age': 22, 'gender': 'Male', 'salary': 12000}]

df = pd.DataFrame(data,index=range(1,7))
print(df)

       name  age  gender  salary
1  Shreeram   27    Male   10000
2     Shree   28  Female   12000
3       Ram   29    Male   12000
4      Riya   45    Male   13000
5    Sushma   15  Female   11000
6      John   22    Male   12000

In [35]:
data = [['id','name','age'],[1,"Riya",23],[2,"Shree",25],[3,"John",22],[4,"Shreeram",27],[5,"Ram",29]]
data = pd.DataFrame(data,columns=data[0])
data = data.set_index('id')
print(data)

        name  age
id
id      name  age
1       Riya   23
2      Shree   25
3       John   22
4   Shreeram   27
5        Ram   29

In [43]:
data = [[1,'Riya',23,'Delhi'],[2,'Shree',25,'Mumbai'],[3,'John',22,'Pune'],[4,'Shreeram',27,'Delhi'],[5,'Ram',29,'Mumbai']] 
df = pd.DataFrame(data,columns=['Id','Name','Age','City'])
df = df.set_index('Id')
print(df)

        Name  Age    City
Id
1       Riya   23   Delhi
2      Shree   25  Mumbai
3       John   22    Pune
4   Shreeram   27   Delhi
5        Ram   29  Mumbai

list in dictionary

In [54]:
data = {'ID':[1,2,3,4,5],'Name':['Riya','Shree','John','Shreeram','Ram'],'Age':[23,25,22,27,29],'City':['Delhi','Mumbai','Pune','Delhi','Mumbai']}
df = pd.DataFrame(data)
df = df.set_index('ID')
print(df)

        Name  Age    City
ID
1       Riya   23   Delhi
2      Shree   25  Mumbai
3       John   22    Pune
4   Shreeram   27   Delhi
5        Ram   29  Mumbai

Dictionary of series

In [62]:
data = {'Maths':pd.Series([20,25,26]),'Science':pd.Series([30,35,40]),'English':pd.Series([40,45,50])}
df = pd.DataFrame(data)
print(df)

   Maths  Science  English
0     20       30       40
1     25       35       45
2     26       40       50

Numpy array

In [78]:
arr = np.array([[1,2,3,4],[5,6,7,8]])
df = pd.DataFrame(arr,columns=['a','b','c','d'])
print(df)

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

Using CSV file

In [88]:
data = pd.read_csv('names.csv',parse_dates=True,header=0)
data.index= range(1,len(data)+1)
print(data)

       Name  Age    City
1      Riya   23   Delhi
2     Shree   25  Mumbai
3      John   22    Pune
4  Shreeram   27   Delhi
5       Ram   29  Mumbai